**Task 1: How to read random rows from our data**

In [1]:
import pandas as pd
df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017','1/4/2017','1/5/2017','1/6/2017','1/7/2017','1/8/2017','1/9/2017'],
    'temperature': [32,35,28,30,33,31,27,26,25],
    'event': ['Rain', 'Sunny', 'Snow','Rain', 'Sunny', 'Snow','Sunny', 'Rain', 'Snow']
})
df_weather

        day  temperature  event
0  1/1/2017           32   Rain
1  1/2/2017           35  Sunny
2  1/3/2017           28   Snow
3  1/4/2017           30   Rain
4  1/5/2017           33  Sunny
5  1/6/2017           31   Snow
6  1/7/2017           27  Sunny
7  1/8/2017           26   Rain
8  1/9/2017           25   Snow

In [22]:
random_rows=df_weather.sample(n=4)
random_rows

        day  temperature  event
7  1/8/2017           26   Rain
5  1/6/2017           31   Snow
2  1/3/2017           28   Snow
6  1/7/2017           27  Sunny

In [49]:
# Extra task: save 2 columns, last 3 rows only
df_weather[["day","event"]].tail(3).to_csv("mydata.csv", index=False)
df=pd.read_csv("mydata.csv")
df

         day  event
0   1/9/2017   Snow
1  1/10/2017   Rain
2  1/11/2017  Sunny

**Task 2: how to append to an existing csv file, excel file same sheet**

In [56]:
df=pd.read_csv("weather.csv")
# Create a new DataFrame with the data you want to append
new_data = pd.DataFrame({'day': ['1/10/2017','1/11/2017'], 'temperature': [ 24, 28],'event':['Rain','Sunny']})

# Append the new data to the existing DataFrame
df = df.append(new_data, ignore_index=True)

# Save the updated DataFrame to the same CSV file
df.to_csv('weather.csv', index=False, mode='a', header=False)

C:\Users\a\AppData\Local\Temp\ipykernel_6876\3605859064.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_data, ignore_index=True)

**Task 3: replace data in csv file ( interpolate )**    <br>
case 1 : 32, NAN, NAN, NAN, 30 <br> 
case 2 : 32, 30, NAN , NAN , NAN <br>

In [27]:
data1= pd.DataFrame({
    "temperature":[32,'NAN','NAN','NAN',30]
})
data1=data1.astype(float)
data1.to_csv("new.csv")
data1

   temperature
0         32.0
1          NaN
2          NaN
3          NaN
4         30.0

In [28]:
new1=data1.interpolate()
new1.to_csv("new.csv",index=False)
new1

   temperature
0         32.0
1         31.5
2         31.0
3         30.5
4         30.0

In [35]:
data2= pd.DataFrame({
    "temperature":[32,30,'NAN','NAN','NAN']
})
data2=data2.astype(float)
data2.to_csv("trail.csv")
data2

   temperature
0         32.0
1         30.0
2          NaN
3          NaN
4          NaN

In [36]:
new2=data2.interpolate()
new2.to_csv("trail.csv",index=False)
new2

   temperature
0         32.0
1         30.0
2         30.0
3         30.0
4         30.0

**Task 4: replace data in specific columns with specific values**
* Example:

Name     Age 
 Ahmed     23
 Ali       20
 Omar      70

In [48]:
dt=pd.DataFrame({'Name':['Ahmed','Ali','Omar'],'Age':[23,20,70]})
dt

    Name  Age
0  Ahmed   23
1    Ali   20
2   Omar   70

In [50]:
dt.Age =dt.Age.replace({23:25, 70:50})
dt

    Name  Age
0  Ahmed   25
1    Ali   20
2   Omar   50

**<h5>Task 5: How to sort dataframe by index, how to sort dataframe by specific column</h5>**

In [52]:
dataframe= pd.DataFrame({'Name':['Samy','Ramy','Sara','Rana'],'Age':[30,26,21,23]}, index=[6,4,3,5])

In [53]:
dataframe=pd.concat([dataframe,dt])
dataframe

    Name  Age
6   Samy   30
4   Ramy   26
3   Sara   21
5   Rana   23
0  Ahmed   25
1    Ali   20
2   Omar   50

In [54]:
dataframe.sort_index()

    Name  Age
0  Ahmed   25
1    Ali   20
2   Omar   50
3   Sara   21
4   Ramy   26
5   Rana   23
6   Samy   30

In [57]:
dataframe.sort_values('Age')

    Name  Age
1    Ali   20
3   Sara   21
5   Rana   23
0  Ahmed   25
4   Ramy   26
6   Samy   30
2   Omar   50

**<h4>Task : How to combine more than two dataframes at the same time</h4>**
* Like the above code (using concat())

In [23]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [4, 5, 6], 'B': [7, 8, 9]})
df3 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})
combined_df = pd.concat([df1, df2, df3], axis=0)

print(combined_df)

   A   B
0  1   4
1  2   5
2  3   6
0  4   7
1  5   8
2  6   9
0  7  10
1  8  11
2  9  12

**<h4> Task 6: What is lambda expression</h4>**
* Lambda functions are similar to user-defined functions but without a name. They're commonly referred to as anonymous functions.

In [60]:
# lambda argument(s) : expression
x= lambda a : a*2
x(3)

6

In [62]:
list1 = [2, 3, 4, 5]

list(map(lambda x: pow(x, 2), list1))

[4, 9, 16, 25]

In [29]:
my_list = [11, 32, 73, 41, 25]

sum_list = lambda lst: sum(lst)

print(sum_list(my_list))

182

**<h3>Task 7: How to detect and remove outliers using pandas</h3>**

In [18]:
df =  pd.DataFrame({
    'Name': ['Ahmed','Sara','Ali','Saad','Salma','Khaled','Sondos','Seif','Mohamed'],
    'Salary': [200,1000,10000,2000,400,3100,2700,20000,2500],
})

In [19]:
Q1 = df.quantile(0.25)
Q3 = df.quantile(0.75)
IQR = Q3 - Q1
threshold = 1.5
outliers = df[((df < (Q1 - threshold * IQR)) | (df > (Q3 + threshold * IQR))).any(axis=1)]
clean_df = df[~((df < (Q1 - threshold * IQR)) | (df > (Q3 + threshold * IQR))).any(axis=1)]

C:\Users\a\AppData\Local\Temp\ipykernel_16164\996406844.py:1: FutureWarning: The default value of numeric_only in DataFrame.quantile is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  Q1 = df.quantile(0.25)
C:\Users\a\AppData\Local\Temp\ipykernel_16164\996406844.py:2: FutureWarning: The default value of numeric_only in DataFrame.quantile is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  Q3 = df.quantile(0.75)
C:\Users\a\AppData\Local\Temp\ipykernel_16164\996406844.py:5: FutureWarning: Automatic reindexing on DataFrame vs Series comparisons is deprecated and will raise ValueError in a future version. Do `left, right = left.align(right, axis=1, copy=False)` before e.g. `left == right`
  outliers = df[((df < (Q1 - threshold * IQR)) | (df > (Q3 + threshold * IQR))).any(axis=1)]
C:\Users\a\AppData\Local\Temp\ipykernel_16164\996406844.py:5: FutureWarning: Automatic reindexing on DataFrame vs Series comparisons is deprecated and will raise ValueError in a future version. Do `left, right = left.align(right, axis=1, copy=False)` before e.g. `left == right`
  outliers = df[((df < (Q1 - threshold * IQR)) | (df > (Q3 + threshold * IQR))).any(axis=1)]
C:\Users\a\AppData\Local\Temp\ipykernel_16164\996406844.py:6: FutureWarning: Automatic reindexing on DataFrame vs Series comparisons is deprecated and will raise ValueError in a future version. Do `left, right = left.align(right, axis=1, copy=False)` before e.g. `left == right`
  clean_df = df[~((df < (Q1 - threshold * IQR)) | (df > (Q3 + threshold * IQR))).any(axis=1)]
C:\Users\a\AppData\Local\Temp\ipykernel_16164\996406844.py:6: FutureWarning: Automatic reindexing on DataFrame vs Series comparisons is deprecated and will raise ValueError in a future version. Do `left, right = left.align(right, axis=1, copy=False)` before e.g. `left == right`
  clean_df = df[~((df < (Q1 - threshold * IQR)) | (df > (Q3 + threshold * IQR))).any(axis=1)]

In [20]:
outliers

   Name  Salary
2   Ali   10000
7  Seif   20000

In [21]:
clean_df

      Name  Salary
0    Ahmed     200
1     Sara    1000
3     Saad    2000
4    Salma     400
5   Khaled    3100
6   Sondos    2700
8  Mohamed    2500

**<h4>Task 8: Write dataframes to two separate sheets in excel**

In [24]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [27]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")
    writer.save()

C:\Users\a\AppData\Local\Temp\ipykernel_16164\4134861890.py:4: FutureWarning: save is not part of the public API, usage can give unexpected results and will be removed in a future version
  writer.save()